app/views/itineraries/_form.html.erb

SELECT "locations".* FROM "locations"
---
  <div class="col-sm-10">
    <%= select_tag(:location_id, options_from_collection_for_select(Location.all, :id, :city, @itinerary.location_id), :class => "form-control") %>

SELECT "trips".* FROM "trips"
---
  <div class="col-sm-10">
    <%= select_tag(:trip_id, options_from_collection_for_select(Trip.all, :id, :trip_name, @itinerary.trip_id), :class => "form-control") %>