app/views/itineraries/index.html.erb

SELECT  "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT 1  [["id", 1]]
---
      <div class="panel-heading">
        <h3 class="panel-title"><%= itinerary.location.city %>, <%= itinerary.location.country %></h3>