app/views/trips/show.html.erb


      <% @trip.itineraries.order("arrival_date_time ASC").each do |itinerary| %>
---
SELECT "itineraries".* FROM "itineraries" WHERE "itineraries"."trip_id" = ?  ORDER BY arrival_date_time ASC  [["trip_id", 1]]

          <a href="#" class="location_toggle" data-location-id="<%= itinerary.id %>">
            <%= itinerary.location.city %>, <%= itinerary.location.country %>
---
SELECT  "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT 1  [["id", 1]]