app/controllers/itineraries_controller.rb

SELECT "itineraries".* FROM "itineraries"
---
  def index
    @itineraries = Itinerary.all

SELECT  "itineraries".* FROM "itineraries" WHERE "itineraries"."id" = ? LIMIT 1  [["id", 0]]
---
  def show
    @itinerary = Itinerary.find(params[:id])

INSERT INTO "itineraries" ("arrival_date_time", "departure_date_time", "street_address", "location_id", "trip_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @itinerary = Itinerary.new
    @itinerary.arrival_date_time = Chronic.parse(params[:arrival_date_time])
    @itinerary.departure_date_time = Chronic.parse(params[:departure_date_time])
    @itinerary.street_address = params[:street_address]
    @itinerary.location_id = params[:location_id]
    @itinerary.trip_id = params[:trip_id]

    if @itinerary.save

SELECT  "itineraries".* FROM "itineraries" WHERE "itineraries"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @itinerary = Itinerary.find(params[:id])

SELECT  "itineraries".* FROM "itineraries" WHERE "itineraries"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "itineraries" SET "arrival_date_time" = ?, "departure_date_time" = ?, "updated_at" = ? WHERE "itineraries"."id" = ?  [["arrival_date_time", "2015-07-03 14:00:00.000000"], ["departure_date_time", "2015-07-04 07:00:00.000000"], ["updated_at", "2015-06-11 16:41:24.818830"], ["id", 3]]
---
  def update
    @itinerary = Itinerary.find(params[:id])

    @itinerary.arrival_date_time = params[:arrival_date_time]
    @itinerary.departure_date_time = params[:departure_date_time]
    @itinerary.street_address = params[:street_address]
    @itinerary.location_id = params[:location_id]
    @itinerary.trip_id = params[:trip_id]

    if @itinerary.save

SELECT  "itineraries".* FROM "itineraries" WHERE "itineraries"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "itineraries" WHERE "itineraries"."id" = ?  [["id", 3]]
---
  def destroy
    @itinerary = Itinerary.find(params[:id])

    @itinerary.destroy