app/controllers/locations_controller.rb

SELECT  "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT 1  [["id", nil]]
---
  def index
    @locations = Location.where({ :trip_id => current_user.id })

SELECT  "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @location = Location.find(params[:id])

INSERT INTO "locations" ("country", "trip_id", "city", "state", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["country", "France"], ["trip_id", 2], ["city", "Monaco"], ["state", ""], ["created_at", "2015-06-11 20:33:49.544315"], ["updated_at", "2015-06-11 20:33:49.544315"]]
---
  def create
    @location = Location.new
    @location.country = params[:country]
    @location.position = params[:position]
    @location.trip_id = current_user.id
    @location.city = params[:city]
    @location.state = params[:state]

    if @location.save

SELECT  "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @location = Location.find(params[:id])

SELECT  "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "locations" SET "city" = ?, "updated_at" = ? WHERE "locations"."id" = ?  [["city", "Grenoble"], ["updated_at", "2015-06-11 20:42:00.606402"], ["id", 7]]
---
  def update
    @location = Location.find(params[:id])

    @location.country = params[:country]
    @location.position = params[:position]
    @location.trip_id = current_user.id
    @location.city = params[:city]
    @location.state = params[:state]

    if @location.save

SELECT  "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "locations" WHERE "locations"."id" = ?  [["id", 3]]
---
  def destroy
    @location = Location.find(params[:id])

    @location.destroy