app/controllers/trips_controller.rb

  def index
    @trips = Trip.where({ :user_id => current_user.id })
---
SELECT "trips".* FROM "trips" WHERE "trips"."user_id" = ?  [["user_id", 1]]