app/controllers/trips_controller.rb

SELECT "trips".* FROM "trips"
---
  def index
    @trips = Trip.all

SELECT  "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @trip = Trip.find(params[:id])

INSERT INTO "trips" ("user_id", "trip_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["trip_name", "test"], ["created_at", "2015-06-11 20:24:18.143633"], ["updated_at", "2015-06-11 20:24:18.143633"]]
---
  def create
    @trip = Trip.new
    @trip.user_id = params[:user_id]
    @trip.trip_name = params[:trip_name]

    if @trip.save

SELECT  "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @trip = Trip.find(params[:id])

SELECT  "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT 1  [["id", 5]]
UPDATE "trips" SET "trip_name" = ?, "updated_at" = ? WHERE "trips"."id" = ?  [["trip_name", "Eurotripping"], ["updated_at", "2015-06-11 20:55:34.686965"], ["id", 5]]
---
  def update
    @trip = Trip.find(params[:id])

    @trip.user_id = params[:user_id]
    @trip.trip_name = params[:trip_name]

    if @trip.save

SELECT  "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "trips" WHERE "trips"."id" = ?  [["id", 2]]
---
  def destroy
    @trip = Trip.find(params[:id])

    @trip.destroy